Zad. 5/artillery/homework.yml
config:
  target: "https://postman-echo.com/"
  phases:
    - duration: 2
      arrivalRate: 4
      name: Artillery homework
  plugins:
    ensure: {}
  ensure:
    thresholds:
      - http.response_time.p95: 1500
    conditions:
      - expression: http.request_rate >= 2
  payload:
    -
      path: "keywords.csv"
      fields:
        - "keyword1"
        - "keyword2"
      order: sequence

scenarios:
  - name: Getting a resource
    flow:
      - get:
          url: "{{ target }}get?param1={{ **keyword1** }}"
      - post:
          url: "{{ target }}post?param2={{ **keyword2** }}"
          json:
            username: "Test User"
            password: "Temp Password"
          capture:
            - json: "$.json"
              as: "request_body"
            - json: "$.headers.Host"
              as: "host"